{
  "backend/main.mo": "Main backend actor implementing HR management system with employee records, leave requests, payslips, letters, and role-based access control using mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report documenting four debugging features focused on fixing the Add Employee button rendering issue in EmployeeDirectory.tsx through logging, role verification, fallback rendering, and conditional block removal.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with emphasis on authentication, employee management, and UI styling with warm earth-tone color scheme.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using warm earth tones and greens for the HR portal design system.",
  "frontend/index.html": "HTML entry point for the HR Management Portal application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with protected routes, authentication flow using Internet Identity, profile setup modal, and loading states for all HR portal pages.",
  "frontend/src/components/auth/LoginPage.tsx": "Login page component displaying HR portal branding, feature highlights, hero image, and Internet Identity login button with error handling and loading states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal dialog for new users to complete their profile setup by entering their full name and selecting a role (employee, manager, HR staff, etc.). Uses a non-dismissible dialog that saves the profile via the useSaveCallerUserProfile hook.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable component that displays an empty state with an icon, title, description, and optional action button. Used to show placeholder content when lists or data are empty.",
  "frontend/src/components/common/LoadingSpinner.tsx": "Reusable loading spinner component with configurable size (sm/md/lg) and optional text label. Uses Lucide's Loader2 icon with animation.",
  "frontend/src/components/employees/AddEmployeeForm.tsx": "Form component for adding new employees with fields for personal details, employment info (department, designation, joining date), address, and emergency contacts. Handles date conversion to nanoseconds for Motoko backend and uses react-hook-form for validation.",
  "frontend/src/components/employees/AddEmployeeModal.tsx": "Modal wrapper component that displays the AddEmployeeForm in a dialog with header and close button. Handles open/close state and passes success/cancel callbacks to the form.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component that combines Header and Sidebar with responsive behavior. Manages sidebar open/close state and provides container for main content area.",
  "frontend/src/components/layout/Header.tsx": "Top navigation header with menu toggle, app logo/title, and user profile dropdown showing avatar with initials, role, and logout option. Uses Internet Identity for authentication.",
  "frontend/src/components/layout/Sidebar.tsx": "Navigation sidebar with links to Dashboard, Employees, Leave, Attendance, Payroll, Help Desk, and Admin Panel. Responsive with mobile overlay and highlights active route.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Handles actor initialization with admin token and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle. Provides login status tracking and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, employee data, leave balances, leave requests, payslips, and letters from the backend actor. Includes hooks for checking admin status and managing employee registration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using warm earth tones and greens. Defines utility classes for status badges (approved, pending, rejected, active, inactive).",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge for conditional CSS class merging.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPanel.tsx": "Admin panel page that checks user permissions and displays system statistics (users, sessions, health) with placeholder configuration options for administrators.",
  "frontend/src/pages/Attendance.tsx": "Attendance tracking page showing stats for present/absent days, late arrivals, and working hours with clock in/out buttons and a placeholder calendar view.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying hero section, statistics cards (employees, leaves, attendance, approvals), and quick action cards for recent activities and events.",
  "frontend/src/pages/EmployeeDirectory.tsx": "Employee directory page with search/filter functionality, role-based permission checks for adding employees, and a debug mode floating button. Displays employee cards with avatars and department badges.",
  "frontend/src/pages/EmployeeProfile.tsx": "Displays detailed employee profile page with avatar, contact information, employment details, and formatted dates; fetches employee data by ID from route params and shows loading/error states.",
  "frontend/src/pages/HelpDesk.tsx": "Help desk page with ticket creation button, search and filter UI, and empty state component; currently shows placeholder UI without functional ticket management.",
  "frontend/src/pages/LeaveManagement.tsx": "Leave management page displaying leave type balances (annual, sick, casual, unpaid) in cards and a request leave button; shows empty leave history with placeholder data.",
  "frontend/src/pages/Payroll.tsx": "Payroll page showing current month salary breakdown (gross, deductions, net) and quick action buttons for downloading payslips; displays placeholder data with empty payslip history.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including sidebar colors, custom border radius variables, font families (Inter, Lexend), and animation keyframes setup.",
  "project_state.json": "Project state tracking document describing an HR management portal with employee lifecycle features; notes persistent issue with Add Employee button not being visible after deployment attempts."
}